#ifndef IENTITY_H
#define IENTITY_H

#include <string>

//using namespace std;
/**
 * @interface IEntity
 * @brief Абстрактний інтерфейс для всіх сутностей системи.
 * *  Визначає контракт для класів-нащадків, забезпечуючи уніфікований
 * спосіб відображення та збереження даних.
 */
class IEntity {
public:
	/**
	 * @brief Чистий віртуальний метод для виводу даних у консоль.
	 * Реалізується кожним нащадком індивідуально (Поліморфізм)
	 */
	virtual void Display() const = 0;

	/**
	 * @brief Чистий віртуальний метод для формування CSV-рядка.
	 * Використовується для серіалізації об'єктів при записі у файл
	 * @return Рядок у форматі "значення1,значення2,..."
	 */
	virtual std::string ToCsv() const = 0;

	/**
	 * @brief Віртуальний деструктор.
	 * Для коректних викликів деструкторів нащадків(Dish, Drink).
	 * при видаленні через вказівник на базовий клас.
	 */
	virtual ~IEntity() {}
};

#endif